https://jinisbonusbook.tistory.com/68

In [1]:
import webbrowser
webbrowser.open('https://truman.tistory.com/102')

True

In [3]:
!pip install cx_oracle

Requirement already satisfied: cx_oracle in c:\anaconda3\envs\cakd5\lib\site-packages (8.3.0)

In [1]:
import cx_Oracle
# dsn = cx_Oracle.makedsn('localhost',1521,'xe')
dsn = cx_Oracle.makedsn('localhost',1521,'xe')
dsn

'(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1521))(CONNECT_DATA=(SID=xe)))'

In [4]:
db = cx_Oracle.connect("c##CABA","CABA",dsn)
db

In [5]:
# pdb 연결
# connect = cx_Oracle.connect("사용자이름", "비밀번호", "호스트이름:포트/서비스이름")
# cursor = connect.cursor()
import cx_Oracle
db = cx_Oracle.connect("c##CABA","CABA","localhost:1521/xe")

In [7]:
import pandas as pd
cursor = db.cursor()
cursor.execute("select * from CUSTOMER")
x = cursor.fetchall()
df = pd.DataFrame(x)
df.head()

   0    1         2              3
0  1  박지성   영국 맨체스타  000-5000-0001
1  2  김연아   대한민국 서울  000-6000-0001
2  3  장미란  대한민국 강원도  000-7000-0001
3  4  추신수  미국 클리블랜드  000-8000-0001
4  5  박세리   대한민국 대전           None

In [15]:
# user_tab_columns : 오라클에서 유저(hr)가 가지고 있는 테이블의 컬럼 정보만 가지고 있는 테이블
import pandas as pd
cursor = db.cursor()
cursor.execute("select * from CUSTOMER")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'CUSTOMER'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

   CUSTID NAME   ADDRESS          PHONE
0       1  박지성   영국 맨체스타  000-5000-0001
1       2  김연아   대한민국 서울  000-6000-0001
2       3  장미란  대한민국 강원도  000-7000-0001
3       4  추신수  미국 클리블랜드  000-8000-0001
4       5  박세리   대한민국 대전           None

In [14]:
cursor.execute('select * from BOOK')
x = cursor.fetchall()

columns = ['BOOKID','BOOKNAME','PUBLISHER','PRICE']
df = pd.DataFrame(x,columns=columns)
df1 = df.sort_values('BOOKID')
df1.head()

   BOOKID BOOKNAME PUBLISHER  PRICE
2       1   축구의 역사      굿스포츠   7000
3       2  축구아는 여자       나무수  13000
4       3   축구의 이해     대한미디어  22000
5       4   골프 바이블     대한미디어  35000
6       5    피겨 교본      굿스포츠   8000

In [8]:
df.iloc[0]

0                1
1              박지성
2          영국 맨체스타
3    000-5000-0001
Name: 0, dtype: object

In [7]:
cursor.close()
db.close()

In [11]:
# 오라클에서 사용한것과 같이 create table을 사용하여 테이블을 생성하고 insert into로 값을 넣어준다.

cursor.execute("create table python(id number)")
cursor.execute("insert into python(id) values(1)")
db.commit()

In [22]:
# 오라클 DB에서 불러온 테이블을 데이터 프레임 형식으로 확인해보면 컬럼이 없는것을 확인할 수 있다.
import pandas as pd

db = cx_Oracle.connect("HR","HR","localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from employees")
x = cursor.fetchall()
df = pd.DataFrame(x)
df.head()

,0,1,2,3,4,5,6,7,8,9,10
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0

In [23]:
# user_tab_columns : 오라클에서 유저(hr)가 가지고 있는 테이블의 컬럼 정보만 가지고 있는 테이블

cursor.execute("""select column_name from user_tab_columns where table_name = 'EMPLOYEES'""")

col = cursor.fetchall()
df.columns = col
df.columns

Index([   ('EMPLOYEE_ID',),     ('FIRST_NAME',),      ('LAST_NAME',),
                ('EMAIL',),   ('PHONE_NUMBER',),      ('HIRE_DATE',),
               ('JOB_ID',),         ('SALARY',), ('COMMISSION_PCT',),
           ('MANAGER_ID',),  ('DEPARTMENT_ID',)],
      dtype='object')

In [24]:
# 튜플이 내장된 리스트 형식에서 값만 뽑아내기 

col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0